-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Apr 18, 2023 at 07:40 PM
-- Server version: 10.4.27-MariaDB
-- PHP Version: 8.2.0

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `offices`
--

-- --------------------------------------------------------

--
-- Table structure for table `offices`
--

CREATE TABLE `offices` (
  `key` int(5) NOT NULL,
  `Floor_Number` varchar(40) NOT NULL,
  `Major` varchar(5) NOT NULL,
  `Roundabout` int(5) NOT NULL,
  `Office_Name` varchar(50) NOT NULL,
  `First_Name` varchar(20) NOT NULL,
  `Maintenance` varchar(20) NOT NULL,
  `Office_Number` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `offices`
--

INSERT INTO `offices` (`key`, `Floor_Number`, `Major`, `Roundabout`, `Office_Name`, `First_Name`, `Maintenance`, `Office_Number`) VALUES
(1, 'الدور الاول', '', 1, 'معمل', '-', 'G106', '1A-142'),
(2, 'الدور الاول', '', 1, 'النادي العلمي', '-', 'G107', '1A-141'),
(3, 'الدور الاول', '', 1, 'قاعة اجتماعات كلية علوم الحاسب والمعلومات', '-', 'G109-G108', '1A-140'),
(4, 'الدور الاول', '', 1, 'أعضاء تدريس إدارة', '-', 'G110', '1A-139'),
(5, 'الدور الاول', '', 1, '-', '-', 'G116', '1A-134'),
(6, 'الدور الاول', '', 1, 'علاقات عامة', '-', 'G117', '1A-133'),
(7, 'الدور الاول', '', 1, 'مركز الأبحاث', '-', 'G118-G119', '1A-132'),
(8, 'الدور الاول', '', 1, '-', '-', 'G120', '1A-131'),
(9, 'الدور الاول', '', 1, 'زائرات', '-', 'G121', '1A-130'),
(10, 'الدور الثاني', 'IT', 1, '-', ' ريم عسيري', 'F101', '2A-146'),
(11, 'الدور الثاني', 'IT', 1, '-', 'نوره الغامدي', 'F102', '2A-145'),
(12, 'الدور الثاني', 'IT', 1, '-', 'ذهب البحيري', 'F102', '2A-145'),
(13, 'الدور الثاني', 'IT', 1, '-', 'أ/ حنان الوادي', 'F103', '2A-144'),
(14, 'الدور الثاني', 'IT', 1, 'متعاونات', '-', 'F104', '2A-143'),
(15, 'الدور الثاني', 'IT', 1, '-', 'د. نجود العشبان', 'F105', '2A-142'),
(16, 'الدور الثاني', 'IT', 1, '-', 'عبير العريني', 'F107', '2A-141'),
(17, 'الدور الثاني', 'IT', 1, 'وكيلة قسم التقنية', '-', 'F099', '2A-148'),
(18, 'الدور الثاني', 'IT', 1, '-', 'امل الغفيص', 'F108', '2A-140'),
(19, 'الدور الثاني', 'IT', 1, '-', 'حياة المسلم', 'F108', '2A-140'),
(20, 'الدور الثاني', 'IT', 1, '-', 'لجين العواد', 'F109', '2A-139'),
(21, 'الدور الثاني', 'IT', 1, '-', 'نوف الدوسري', 'F109', '2A-139'),
(22, 'الدور الثاني', 'IT', 1, 'اجتماعات قسم التقنية', '-', 'F118', '2A-130'),
(23, 'الدور الثاني', 'IT', 1, '-', 'غادة النفيعي', 'F117', '2A-131'),
(24, 'الدور الثاني', 'IT', 1, '-', 'وعد', 'F117', '2A-131'),
(25, 'الدور الثاني', 'IT', 1, '-', 'فاطمة أبا الخيل', 'F110', '2A-138'),
(26, 'الدور الثاني', 'IT', 1, '-', 'هند الحديثي', 'F110', '2A-138'),
(27, 'الدور الثاني', 'IT', 1, '-', 'شذا الخالدي', 'F116', '2A-132'),
(28, 'الدور الثاني', 'IT', 1, '-', 'جمانه', 'F116', '2A-132'),
(29, 'الدور الثاني', 'IT', 1, '-', 'سهى الثنيان', 'F115', '2A-133'),
(30, 'الدور الثاني', 'IT', 1, '-', 'فاطمة', 'F114', '2A-134'),
(31, 'الدور الثاني', 'IT', 1, '-', 'شموخ', 'F114', '2A-134'),
(32, 'الدور الثاني', 'IT', 1, '-', 'سمر العيسى', 'F113', '2A-135'),
(33, 'الدور الثاني', 'IT', 1, '-', 'نهى القاضي', 'F113', '2A-135'),
(34, 'الدور الثاني', 'IT', 1, '-', 'وتين', 'F111', '2A-137'),
(35, 'الدور الثاني', 'IT', 1, '-', 'شدن', 'F111', '2A-137'),
(36, 'الدور الثاني', 'IT', 1, '-', 'نفلاء الرميان', 'F112', '2A-136'),
(37, 'الدور الثاني', 'IS', 2, '-', 'د. نهى الشقيران', 'F089', '2A-236'),
(38, 'الدور الثاني', 'IS', 2, 'مكتب التصوير', '-', 'F088', '2A-237'),
(39, 'الدور الثاني', 'IS', 2, 'وحدة التصوير', '-', 'F083', '2A-241'),
(40, 'الدور الثاني', 'IS', 2, '-', 'رحمة الأحمري', 'F082', '2A-242'),
(41, 'الدور الثاني', 'IS', 2, '-', 'نوف', 'F090', '2A-235'),
(42, 'الدور الثاني', 'IS', 2, '-', 'ندى', 'F090', '2A-235'),
(43, 'الدور الثاني', 'IS', 2, '-', 'هيفاء الحسيني', 'F091', '2A-234'),
(44, 'الدور الثاني', 'IS', 2, '-', 'سارة الراشد', 'F092', '2A-233'),
(45, 'الدور الثاني', 'IS', 2, '-', 'فاطمه الجرباء', 'F081', '2A-243'),
(46, 'الدور الثاني', 'IS', 2, '-', 'عبير', 'F080', '2A-244'),
(47, 'الدور الثاني', 'IS', 2, '-', 'سارة', 'F080', '2A-244'),
(48, 'الدور الثاني', 'IS', 2, '-', 'راويه بن شيحه', 'F079', '2A-245'),
(49, 'الدور الثاني', 'IS', 2, '-', 'نجلاء الحسون', 'F093', '2A-232'),
(50, 'الدور الثاني', 'IS', 2, '-', 'شذى', 'F078', '2A-246'),
(51, 'الدور الثاني', 'IS', 2, '-', 'بشائر', 'F078', '2A-246'),
(52, 'الدور الثاني', 'IS', 2, '-', 'د. صالحة العتيبي', 'F094', '2A-231'),
(53, 'الدور الثاني', 'IS', 2, 'مكتبة قسم التقنية', '-', 'F095', '2A-230'),
(54, 'الدور الثاني', 'IS', 2, 'البحث العلمي', '-', 'F076', '2A-248'),
(55, 'الدور الثاني', 'IS', 2, '-', 'هند', 'F077', '2A-247'),
(56, 'الدور الثاني', 'IS', 2, '-', 'فاطمة', 'F077', '2A-247'),
(57, 'الدور الثالث', 'CS', 1, '-', 'تسنيم', 'S111', 'ЗА-147'),
(58, 'الدور الثالث', 'CS', 1, 'مكتبة إدارة المعلومات', '-', 'S110', '3A-145'),
(59, 'الدور الثالث', 'CS', 1, 'مشاريع إدارة المعلومات', '-', 'S129', '3A-130'),
(60, 'الدور الثالث', 'CS', 1, '-', 'د. عريب العويشق', 'S128', 'ЗА-131'),
(61, 'الدور الثالث', 'CS', 1, '-', 'هدى المزيني', 'S112', '3A-146'),
(62, 'الدور الثالث', 'CS', 1, '-', 'ولاء الصرامي', 'S113', '3A-145'),
(63, 'الدور الثالث', 'CS', 1, '-', 'د. أمل السيف', 'S114', '3А-144'),
(64, 'الدور الثالث', 'CS', 1, '-', 'د. سارة الحمود', 'S115', 'ЗА-143'),
(65, 'الدور الثالث', 'CS', 1, '-', 'دانيه العمر', 'S127', 'ЗА-132'),
(66, 'الدور الثالث', 'CS', 1, '-', 'د. تهاني البلوي', 'S126', '3А-133'),
(67, 'الدور الثالث', 'CS', 1, '-', 'د. بسمة القاضي', 'S125', '3А-134'),
(68, 'الدور الثالث', 'CS', 1, '-', 'بسمة الصولي', 'S124', '3А-135'),
(69, 'الدور الثالث', 'CS', 1, '-', 'د. ايمان الزيد', 'S116', '3A-142'),
(70, 'الدور الثالث', 'CS', 1, '-', 'جوزاء المطيري', 'S118', 'ЗА-141'),
(71, 'الدور الثالث', 'CS', 1, '-', 'د. دلال الضوي', 'S119', '3A-140'),
(72, 'الدور الثالث', 'CS', 1, '-', 'د. أسماء الصالح', 'S120', '3A-139'),
(73, 'الدور الثالث', 'CS', 1, '-', 'د. هيفاء بن قاسم', 'S121', '3A-138'),
(74, 'الدور الثالث', 'CS', 1, '-', 'منيرة الشبل', 'S122', '3A-137'),
(75, 'الدور الثالث', 'CS', 1, '-', 'د. ارام السدراني', 'S123', '3A-136'),
(76, 'الدور الثالث', 'CS', 2, '-', 'د. لميس الهزاع', 'S100', 'ЗА-236'),
(77, 'الدور الثالث', 'CS', 2, 'اجتماعات قسم العلوم', '-', 'S099', '3A-237'),
(78, 'الدور الثالث', 'CS', 2, 'وكيلة قسم العلوم', '-', 'S096', '3A-241'),
(79, 'الدور الثالث', 'CS', 2, 'سكرتيرة قسم العلوم', '-', 'S095', '3A-242'),
(80, 'الدور الثالث', 'CS', 2, '-', 'د. وعد الحوشان', 'S101', '3А-235'),
(81, 'الدور الثالث', 'CS', 2, '-', 'افنان', 'S094', '3А-243'),
(82, 'الدور الثالث', 'CS', 2, '-', 'مزنه المطيري', 'S102', '3А-234'),
(83, 'الدور الثالث', 'CS', 2, '-', 'د. مها الربيعة', 'S103', 'ЗА-233'),
(84, 'الدور الثالث', 'CS', 2, '-', 'د. منال السبهان', 'S093', 'ЗА-244'),
(85, 'الدور الثالث', 'CS', 2, '-', 'د. منان المسلم', 'S092', 'ЗА-245'),
(86, 'الدور الثالث', 'CS', 2, '-', 'فاطمه العنزي', 'S104', '3А-232'),
(87, 'الدور الثالث', 'CS', 2, '-', 'وجدان بن سعيدان', 'S091', 'ЗА-246'),
(88, 'الدور الثالث', 'CS', 2, '-', 'ضحى بن نور الدين', 'S105', '3A-231'),
(89, 'الدور الثالث', 'CS', 2, '-', 'د. عبير النفجان', 'S106', '3А-230'),
(90, 'الدور الثالث', 'CS', 2, 'مكتبة قسم العلوم', '-', 'S089', '3А-248'),
(91, 'الدور الثالث', 'CS', 2, '-', 'سحر بو سعيد', 'S090', 'ЗА-247'),
(92, 'الدور الرابع', 'IM', 1, '-', 'د. عليا السليمي', 'T117', '4A-144'),
(93, 'الدور الرابع', 'IM', 1, '-', 'د. ريمية العتيبي', 'T114', '4А-147'),
(94, 'الدور الرابع', 'IM', 1, '-', 'أ.د. مها الخثعمي', 'T115', '4A-146'),
(95, 'الدور الرابع', 'IM', 1, '-', 'د. موضي الدبيان', 'T116', '4A-145'),
(96, 'الدور الرابع', 'IM', 1, 'اجتماعات إدارة المعلومات ', '-', 'T113', '4A-148'),
(97, 'الدور الرابع', 'IM', 1, 'وكيلة إدارة المعلومات', '-', 'T132', '4A-130'),
(98, 'الدور الرابع', 'IM', 1, 'سكرتيرة إدارة المعلومات ', '-', 'T131', '4А-131'),
(99, 'الدور الرابع', 'IM', 1, 'مساعدة إدارة المعلومات', '-', 'T130', '4А-132'),
(100, 'الدور الرابع', 'IM', 1, '-', 'د.أمل السالم', 'T129', '4A-133'),
(101, 'الدور الرابع', 'IM', 1, '-', 'د. هند عافية', 'T128', '4A-134'),
(102, 'الدور الرابع', 'IM', 1, '-', 'د. أمل العمران', 'T118', '4A-143'),
(103, 'الدور الرابع', 'IM', 1, '-', 'ابرار المجلي', 'T127', '4A-135'),
(104, 'الدور الرابع', 'IM', 1, '-', 'د. لولوة السويدان', 'T119', '4A-142'),
(105, 'الدور الرابع', 'IM', 1, '-', 'د. مريم العوشن', 'T121', '4A-141'),
(106, 'الدور الرابع', 'IM', 1, '-', 'د. منى الغانم', 'T122', '4A-140'),
(107, 'الدور الرابع', 'IM', 1, '-', 'د. نوف الشريف', 'T123', '4A-139'),
(108, 'الدور الرابع', 'IM', 1, '-', 'حنان الاسمري', 'T124', '4A-138'),
(109, 'الدور الرابع', 'IM', 1, '-', 'د. العنود السالم', 'T125', '4A-137'),
(110, 'الدور الرابع', 'IM', 1, '-', 'د. أريج العسكر', 'T126', '4A-136'),
(111, 'الدور الرابع', 'IS', 2, '-', 'د. موضي ال الشيخ', 'T102', '4A-236'),
(112, 'الدور الرابع', 'IS', 2, '-', 'د. لجين الدهش', 'T103', '4A-235'),
(113, 'الدور الرابع', 'IS', 2, 'قاعة اجتماعات النظم', '-', 'Т101', '4A-237'),
(114, 'الدور الرابع', 'IS', 2, 'وكيلة قسم النظم', '-', 'T096', '4A-241'),
(115, 'الدور الرابع', 'IS', 2, 'سكرتيرة قسم النظم', '-', 'T095', '4А-242'),
(116, 'الدور الرابع', 'IS', 2, 'مساعدة قسم النظم', '-', 'T094', '4A-243'),
(117, 'الدور الرابع', 'IS', 2, '-', 'د. ميسون الدخيل', 'T104', '4А-234'),
(118, 'الدور الرابع', 'IS', 2, '-', 'د. هياء الحقباني', 'T093', '4А-244'),
(119, 'الدور الرابع', 'IS', 2, '-', 'د. منى الخطابي', 'T105', '4A-233'),
(120, 'الدور الرابع', 'IS', 2, '-', 'د.هالة ال الشيخ', 'T092', '4A-245'),
(121, 'الدور الرابع', 'IS', 2, '-', 'د. ايات عثمان', 'T106', '4A-232'),
(122, 'الدور الرابع', 'IS', 2, '-', 'د. هلا الرميح', 'T091', '4A-246'),
(123, 'الدور الرابع', 'IS', 2, '-', 'د. عبير الحربي', 'T107', '4A-231'),
(124, 'الدور الرابع', 'IS', 2, 'مكتبة قسم النظم', '-', 'T108', '4A-230'),
(125, 'الدور الرابع', 'IS', 2, '-', 'يارا المهنا', 'T089', '4A-248'),
(126, 'الدور الرابع', 'IS', 2, '-', 'د. عبير السند', 'T090', '4А-247'),
(127, 'الدور الثالث', '', 0, 'وحدة التدريب', 'ا/ وجدان البكري', 'S065', '3A-344'),
(128, 'الدور الثالث', '', 0, 'وحدة التدريب', 'ا/ أحلام النجيدي', 'S065', '3A-344'),
(129, 'الدور الثالث', '', 0, 'شؤون الطالبات', 'ا/ ابتسام المنيف', 'S063', '3A-345'),
(130, 'الدور الثالث', '', 0, 'شؤون الطالبات', 'ا/ نوره المدهش', 'S063', '3A-345'),
(131, 'الدور الثالث', '', 0, 'شؤون الطالبات', 'ا/ ابتسام الشلهوب', 'S063', '3A-345'),
(132, 'الدور الثالث', '', 0, 'شؤون الطالبات', 'ا/ سحر المنيعي', 'S063', '3A-345'),
(133, 'الدور الثالث', '', 0, 'شؤون الطالبات', 'ا/ الجوهره الحميضي', 'S063', '3A-345'),
(134, 'الدور الثالث', '', 0, 'الاخصائية الاجتماعية', 'ناهد الريسي', 'S060', '3A-348'),
(135, 'الدور الثالث', '', 0, 'الاخصائية النفسية', 'زهراء الحربان', 'S058', '3A-350'),
(136, 'الدور الرابع', '', 0, 'وحدة النشاط', 'ا/ اروى المنيف', 'T063', '4A-350'),
(137, 'الدور الرابع', '', 0, 'وحدة النشاط', 'ا/ هديل الدهش', 'T063', '4A-350'),
(138, 'الدور الرابع', '', 0, 'وحدة النشاط', 'ا/ اسيل العبدالكريم', 'T063', '4A-350'),
(139, 'الدور الرابع', '', 0, 'لجنة الاعذار', 'ا/ دلال القفاري', 'T062', '4A-351'),
(140, 'الدور الرابع', '', 0, 'لجنة الاعذار', 'ا/ هياء العيد', 'T062', '4A-351'),
(141, 'الدور الرابع', '', 0, 'لجنة الاعذار', 'ا/ راويه العريني', 'T062', '4A-351'),


--
-- Indexes for dumped tables
--

--
-- Indexes for table `offices`
--
ALTER TABLE `offices`
  ADD PRIMARY KEY (`key`) USING BTREE,
  ADD KEY `First_Name` (`First_Name`);
ALTER TABLE `offices` ADD FULLTEXT KEY `Office_Name` (`Office_Name`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `offices`
--
ALTER TABLE `offices`
  MODIFY `key` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=153;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
